### Total: 17

2016
- 8

2020
- 9

In [21]:
import pandas as pd
import numpy as np

In [22]:
df = pd.read_csv('ub_w.csv')

## 2016

1. liya mustafina (RUS) 
2. madison kocian (USA) 	
3. sophie scheder (GER)

## 2020

1. nina derwael (BEL) 	
2. anastasia ilyankova (ROC)  - 1 comp	
3. sunisa lee (USA) - 1 comp

In [23]:
df['year'].value_counts()

year
2023    644
2022    586
2021    200
2019    109
2015     65
2014     54
2013     46
2018     16
2020      8
2011      8
2017      8
2016      8
Name: count, dtype: int64

In [24]:
df = pd.read_csv('ub_w.csv')
df['Name'] = df['Name'].str.lower()

In [25]:
df['Name'] = df['Name'].str.lower()

In [26]:
df12 = df[df['year'].isin([2011])].copy()
df16 = df[df['year'].isin([2013, 2014, 2015, 2016])].copy()
df20 = df[df['year'].isin([2017, 2018, 2019, 2020])].copy()
df24 = df[df['year'].isin([2022, 2023])].copy()

In [27]:
# Define a function to assign medal values based on the "Name" column
def assign_medal(name):
    name_lower = name.lower()
    if name_lower == 'aliya mustafina':
        return 1
    elif name_lower == 'madison kocian':
        return 1
    elif name_lower == 'sophie scheder':
        return 1
    else:
        return 0

# Apply the function to create the "medal" column
df16['medal'] = df16['Name'].apply(assign_medal)

In [28]:
df16['medal'].value_counts()

medal
0    165
1      8
Name: count, dtype: int64

In [29]:
df16[df16['Name']== 'aliya mustafina']

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round,medal
1432,3.0,aliya mustafina,RUS,6.5,8.533,0.0,15.033,2013,final,1
1443,6.0,aliya mustafina,RUS,6.3,8.800,0.0,15.100,2014,final,1

In [30]:
df16[df16['Name']== 'madison kocian']

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round,medal
1449,1.0,madison kocian,USA,6.6,8.766,0.0,15.366,2015,final,1
1703,2.0,madison kocian,USA,6.3,8.525,0.0,14.825,2014,final,1

In [31]:
df16[df16['Name']== 'sophie scheder']

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round,medal
1363,5.0,sophie scheder,GER,6.2,7.100,0.0,13.300,2013,final,1
1368,2.0,sophie scheder,GER,6.2,8.100,0.0,14.300,2013,qual,1
1434,5.0,sophie scheder,GER,6.4,8.283,0.0,14.683,2013,final,1
1453,8.0,sophie scheder,GER,6.6,8.000,0.0,14.600,2015,final,1

In [32]:
# Define a function to assign medal values based on the "Name" column
def assign_medal(name):
    name_lower = name.lower()
    if name_lower == 'nina derwael':
        return 1
    elif name_lower == 'anastasia ilyankova':
        return 1
    elif name_lower == 'sunisa lee':
        return 1
    else:
        return 0

# Apply the function to create the "medal" column
df20['medal'] = df20['Name'].apply(assign_medal)

In [33]:
df20['medal'].value_counts()

medal
0    132
1      9
Name: count, dtype: int64

In [34]:
# Assuming you have a DataFrame named 'df'
name_counts = df16['Name'].value_counts()

# Print the counts for each name
print("aliya Mustafina:", name_counts.get("aliya mustafina", 0))
print("Madison Kocian:", name_counts.get("madison kocian", 0))
print("Sophie Scheder:", name_counts.get("sophie scheder", 0))

aliya Mustafina: 2
Madison Kocian: 2
Sophie Scheder: 4

In [35]:
# Assuming you have a DataFrame named 'df'
name_counts = df20['Name'].value_counts()

print("nina derwael:", name_counts.get("nina derwael", 0))
print("anastasia ilyankova:", name_counts.get("anastasia ilyankova", 0))
print("sunisa lee:", name_counts.get("sunisa lee", 0))

nina derwael: 7
anastasia ilyankova: 1
sunisa lee: 1

In [36]:
combined_df = pd.concat([df20, df16], axis=0)

In [37]:
df = combined_df.copy()

In [38]:
df['medal'].value_counts()

medal
0    297
1     17
Name: count, dtype: int64

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 314 entries, 1271 to 1709
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     314 non-null    float64
 1   Name     314 non-null    object
 2   nation   314 non-null    object
 3   D Score  314 non-null    float64
 4   E Score  314 non-null    float64
 5   Pen.     314 non-null    float64
 6   Total    314 non-null    float64
 7   year     314 non-null    int64
 8   round    314 non-null    object
 9   medal    314 non-null    int64
dtypes: float64(5), int64(2), object(3)
memory usage: 27.0+ KB